Tekla Open API Reference for Tekla Structures 2025
OBB.SetExtent Method (Double, Double, Double)
 Sets the extents to the OBB.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public void SetExtent(
	double extent0,
	double extent1,
	double extent2
)
Public Sub SetExtent (
	extent0 As Double,
	extent1 As Double,
	extent2 As Double
)
Parameters
extent0
Type: System.Double
The extent (half-length) of the side parallel to axis one.
extent1
Type: System.Double
The extent (half-length) of the side parallel to axis two.
extent2
Type: System.Double
The extent (half-length) of the side parallel to axis three.
Exceptions
Exception | Condition
ArgumentException | Thrown when setting the extent fails.
See Also
Reference
OBB Class
SetExtent Overload
Tekla.Structures.Geometry3d Namespace